import React from 'react';

import './Facts.css';

interface Props {
 
}

export function Facts({}: Props) {
  return (
    <div className="about-us">
      <h1>Научные факты</h1>
      
      
      <p>
      <h2> Научно подтвержденные целебные свойства экстракта черного тмина </h2>
Современные исследования подтверждают многие традиционные представления о пользе черного тмина. Экстракт демонстрирует впечатляющий спектр терапевтических эффектов.
Прежде всего, он является мощным иммуномодулятором. Регулярное употребление экстракта черного тмина способствует нормализации иммунных реакций организма, повышает сопротивляемость вирусным и бактериальным инфекциям. Это особенно важно в сезоны простуд и гриппа, а также для людей с ослабленным иммунитетом.
Противовоспалительные свойства экстракта черного тмина делают его эффективным средством при различных воспалительных процессах. Тимохинон и другие компоненты способны подавлять выработку противоспалительных цитокинов и медиаторов воспаления, что помогает при артритах, аллергических реакциях и воспалительных заболеваниях кишечника.
Гепатопротекторное действие — еще одно ценное свойство. Экстракт защищает клетки печени от токсических повреждений, стимулирует регенерацию тканей и нормализует обменные процессы в этом важнейшем органе. Исследования показывают, что регулярный прием экстракта может способствовать восстановлению функций печени при различных заболеваниях и интоксикациях.
Особого внимания заслуживает влияние черного тмина на сердечно-сосудистую систему. Он способствует нормализации артериального давления, улучшает липидный профиль крови, снижая уровень "плохого" холестерина (ЛПНП) и повышая концентрацию "хорошего" (ЛПВП). Это помогает предотвратить развитие атеросклероза и связанных с ним осложнений.
Для больных сахарным диабетом экстракт черного тмина представляет особую ценность. Научные исследования демонстрируют его способность снижать уровень глюкозы в крови, повышать чувствительность тканей к инсулину и защищать клетки поджелудочной железы от повреждений. Это делает экстракт полезным дополнением к основной терапии диабета.
Антиоксидантные свойства черного тмина замедляют процессы старения, защищая клетки от окислительного стресса и повреждения свободными радикалами. Регулярное применение экстракта способствует сохранению молодости и красоты кожи, улучшает общее самочувствие и повышает жизненный тонус.
<br />
 <b>ссылка на ресурс:</b>
<a href="https://www.mdpi.com/2072-6643/13/6/1784"> Чёрный тмин (Nigella sativa L.): подробный обзор фитохимии, пользы для здоровья, молекулярной фармакологии и безопасности</a>
</p>

      
      <p>
      <h2> Косточки облепихи: природный источник полезных веществ </h2>
      Состав косточек облепихи
Косточки облепихи представляют особую ценность благодаря уникальному биохимическому составу, научно подтвержденному многочисленными исследованиями:<br />
•	Облепиховое масло – содержит редкое сочетание омега-3, омега-6, омега-7 и омега-9 жирных кислот в оптимальной пропорции<br />
•	Витамин Е (токоферол) – мощный природный антиоксидант (до 160 мг/100 г)<br />
•	Каротиноиды – предшественники витамина А<br />
•	Фитостеролы – растительные соединения, структурно схожие с холестерином<br />
•	Флавоноиды – полифенольные соединения с антиоксидантными свойствами<br />
•	Фосфолипиды – важные компоненты клеточных мембран<br />
<b>Научно доказанные свойства</b><br />
Согласно исследованиям, экстракт косточек облепихи демонстрирует следующие свойства:<br />
•	Антиоксидантная активность – нейтрализует свободные радикалы, замедляя процессы старения клеток<br />
•	Гепатопротекторное действие – защищает клетки печени от токсического повреждения<br />
•	Противовоспалительный эффект – подавляет выработку провоспалительных цитокинов<br />
•	Кардиопротекторное свойство – способствует нормализации липидного профиля крови<br />
•	Регенерирующий потенциал – ускоряет заживление тканей<br />
<b>ссылки на ресурсы:</b>
<a href="https://www.sciencedirect.com/science/article/abs/pii/S1756464611000028">1. Польза облепихи для здоровья в профилактике сердечно-сосудистых заболеваний</a><br />
<a href="https://www.tandfonline.com/doi/abs/10.1080/10408398.2021.1905605"> 2. Биоактивные соединения, польза для здоровья и функциональные пищевые продукты из облепихи: обзор</a>
      </p>
      <p>
      <h2> Кориандр: терапевтические свойства и польза для здоровья </h2>
      <b>Пищеварительная система</b><br />
Экстракт кориандра традиционно используется для улучшения пищеварения. Он стимулирует выработку пищеварительных ферментов и желчи, что способствует лучшему усвоению пищи. Обладает ветрогонным эффектом, помогает при метеоризме, вздутии живота и спазмах кишечника. Исследования показывают его эффективность в борьбе с диспепсическими расстройствами и синдромом раздраженного кишечника.<br />
<b>Антиоксидантное действие</b><br />
Богатый набор флавоноидов и других полифенольных соединений обеспечивает мощные антиоксидантные свойства экстракта кориандра. Он нейтрализует свободные радикалы, защищая клетки от окислительного стресса и преждевременного старения, снижает риск развития хронических и дегенеративных заболеваний.<br />
<b>Противовоспалительные свойства</b><br />
Компоненты экстракта кориандра способны подавлять воспалительные процессы в организме, уменьшая выработку провоспалительных медиаторов. Это делает его ценным средством при артритах, воспалительных заболеваниях кожи и других патологиях, сопровождающихся воспалением.<br />
<b>Детоксикационные свойства</b><br />
Экстракт кориандра известен способностью связывать и выводить из организма тяжелые металлы, в частности, ртуть, свинец и алюминий. Это свойство делает его полезным компонентом детоксикационных программ и профилактики отравлений тяжелыми металлами.<br />
<b>Антимикробное действие</b><br />
Исследования подтверждают антибактериальную и противогрибковую активность экстракта кориандра против широкого спектра патогенных микроорганизмов, включая Staphylococcus aureus, Escherichia coli, Salmonella typhi и Candida albicans. Это обусловлено содержанием эфирных масел, особенно линалоола.<br />
<b>Нормализация уровня сахара и холестерина</b><br />
Регулярное употребление экстракта кориандра способствует снижению уровня глюкозы в крови, повышая чувствительность тканей к инсулину. Также он помогает нормализовать липидный профиль, снижая уровень "плохого" холестерина (ЛПНП) и триглицеридов при одновременном повышении "хорошего" холестерина (ЛПВП).<br />
<b>Неврологическое здоровье</b><br />
Традиционно экстракт кориандра использовался для облегчения тревожности, нервного напряжения и улучшения качества сна. Современные исследования подтверждают его мягкое седативное действие и способность снижать нервное напряжение без выраженного снотворного эффекта.<br />
<b>Поддержка здоровья кожи</b><br />
Благодаря антиоксидантным, противовоспалительным и антимикробным свойствам, экстракт кориандра полезен для кожи. Он помогает при угревой сыпи, экземе, дерматитах, снимает раздражение и зуд, ускоряет заживление мелких повреждений.<br />

<b>ссылки на ресурсы:</b>

<a href="https://journals.lww.com/nutritiontodayonline/FullText/2016/05000/Coriander___Overview_of_Potential_Health_Benefits.8.aspx?kuid=0678409d-0f2f-48c0-b1d8-7620d9ab0df5-1731283200&kref=https%3A%2F%2Fmymindbodybaby.com%2Fnatural-medicine-for-fertility-supplements-herbs-spices%2F"> Кориандр: Обзор потенциальной пользы для здоровья</a>
      </p>
    </div>
  );
}
