import { TProduct, TCategory, ECategories } from "../domain/product/Product"
import Images from "../Images"

export const Products: TProduct[] = [{id:1,category: ECategories.EXTRACTS,name:'Экстракт черного тмина, 3мл',description:['Натуральный флюидный экстракт представлен в удобной стеклянной бутылочке объемом 3 мл с пипеткой-дозатором, которая позволяет точно отмерить необходимое количество продукта. Бутылочка упакована в защитную картонную коробку, обеспечивающую сохранность продукта при транспортировке и хранении.',
        'Экстракт производится исключительно из натурального сырья без добавления искусственных компонентов и соответствует всем стандартам пищевого качества. Это позволяет использовать его как для внутреннего применения, так и в косметических целях.',
        'Для употребления внутрь достаточно добавить несколько капель экстракта в готовое блюдо или напиток. При использовании в домашней косметологии экстракт легко смешивается с любой косметической основой – кремом, маской или сывороткой, обогащая их полезными свойствами.',
        'Срок годности составляет 12 месяцев с даты изготовления при соблюдении условий хранения: температура от 0 до +25°С, относительная влажность воздуха не более 75%. Для сохранения полезных свойств продукта рекомендуется хранить флакон в защищенном от прямых солнечных лучей месте.',
        '100% натуральный состав делает этот экстракт безопасным и эффективным компонентом для создания натуральной косметики в домашних условиях, а также прекрасной добавкой к здоровому рациону питания.'
        ],images:[Images.img7,Images.img_second], price:400},
    {id:2,category: ECategories.EXTRACTS,name:'Экстракт кориандра, 3мл',description:['Натуральный флюидный экстракт представлен в удобной стеклянной бутылочке объемом 3 мл с пипеткой-дозатором, которая позволяет точно отмерить необходимое количество продукта. Бутылочка упакована в защитную картонную коробку, обеспечивающую сохранность продукта при транспортировке и хранении.',
        'Экстракт производится исключительно из натурального сырья без добавления искусственных компонентов и соответствует всем стандартам пищевого качества. Это позволяет использовать его как для внутреннего применения, так и в косметических целях.',
        'Для употребления внутрь достаточно добавить несколько капель экстракта в готовое блюдо или напиток. При использовании в домашней косметологии экстракт легко смешивается с любой косметической основой – кремом, маской или сывороткой, обогащая их полезными свойствами.',
        'Срок годности составляет 12 месяцев с даты изготовления при соблюдении условий хранения: температура от 0 до +25°С, относительная влажность воздуха не более 75%. Для сохранения полезных свойств продукта рекомендуется хранить флакон в защищенном от прямых солнечных лучей месте.',
        '100% натуральный состав делает этот экстракт безопасным и эффективным компонентом для создания натуральной косметики в домашних условиях, а также прекрасной добавкой к здоровому рациону питания.'
        ],images:[Images.img111,Images.kortink], price:400},
    {id:3,category: ECategories.EXTRACTS,name:'Экстракт косточки облепихи, 3мл',description:['Натуральный флюидный экстракт представлен в удобной стеклянной бутылочке объемом 3 мл с пипеткой-дозатором, которая позволяет точно отмерить необходимое количество продукта. Бутылочка упакована в защитную картонную коробку, обеспечивающую сохранность продукта при транспортировке и хранении.',
        'Экстракт производится исключительно из натурального сырья без добавления искусственных компонентов и соответствует всем стандартам пищевого качества. Это позволяет использовать его как для внутреннего применения, так и в косметических целях.',
        'Для употребления внутрь достаточно добавить несколько капель экстракта в готовое блюдо или напиток. При использовании в домашней косметологии экстракт легко смешивается с любой косметической основой – кремом, маской или сывороткой, обогащая их полезными свойствами.',
        'Срок годности составляет 12 месяцев с даты изготовления при соблюдении условий хранения: температура от 0 до +25°С, относительная влажность воздуха не более 75%. Для сохранения полезных свойств продукта рекомендуется хранить флакон в защищенном от прямых солнечных лучей месте.',
        '100% натуральный состав делает этот экстракт безопасным и эффективным компонентом для создания натуральной косметики в домашних условиях, а также прекрасной добавкой к здоровому рациону питания.'
        ],images:[Images.img9,Images.img_second], price:400},
    {id:4,category: ECategories.EXTRACTS,name:'Экстракт косточки граната, 4мл',description:['Натуральный флюидный экстракт представлен в удобной стеклянной бутылочке объемом 3 мл с пипеткой-дозатором, которая позволяет точно отмерить необходимое количество продукта. Бутылочка упакована в защитную картонную коробку, обеспечивающую сохранность продукта при транспортировке и хранении.',
        'Экстракт производится исключительно из натурального сырья без добавления искусственных компонентов и соответствует всем стандартам пищевого качества. Это позволяет использовать его как для внутреннего применения, так и в косметических целях.',
        'Для употребления внутрь достаточно добавить несколько капель экстракта в готовое блюдо или напиток. При использовании в домашней косметологии экстракт легко смешивается с любой косметической основой – кремом, маской или сывороткой, обогащая их полезными свойствами.',
        'Срок годности составляет 12 месяцев с даты изготовления при соблюдении условий хранения: температура от 0 до +25°С, относительная влажность воздуха не более 75%. Для сохранения полезных свойств продукта рекомендуется хранить флакон в защищенном от прямых солнечных лучей месте.',
        '100% натуральный состав делает этот экстракт безопасным и эффективным компонентом для создания натуральной косметики в домашних условиях, а также прекрасной добавкой к здоровому рациону питания.'
        ],images:[Images.img10,Images.img_second], price:400},
    {id:5,category: ECategories.SMART_WATER,name:'«Умная вода» бадьян-манго-маракуйя, 10мл',description:[
        '«Умная вода» бадьян-манго-маракуйя: Эмульсия флюидного экстракта бадьяна,  экстракт эхинацеи пурпурной, аскорбиновая кислота (витамин С), L-карнитин, лимонная кислота, натуральные ароматизаторы (манго, маракуйя).',
        'Идеально подходит для:',
        '• Активных людей, ведущих динамичный образ жизни',
        '• Спортсменов и тех, кто занимается фитнесом',
        '• Людей, испытывающих повышенные умственные нагрузки',
        '• Тех, кто хочет укрепить свой иммунитет естественным путем',
        '• Людей, желающих поддерживать здоровый вес',
        '• Тех, кто ищет натуральное средство для поддержания общего тонуса'
    ],images:[Images.img8,Images.img8], price:1500},
    {id:6,category: ECategories.SMART_WATER,name:'«Умная вода» имбирь-мята-апельсин, 10мл',description:[
        '«Умная вода» имбирь-мята-апельсин: Эмульсия флюидного экстракта корня имбиря,  экстракт эхинацеи пурпурной, аскорбиновая кислота (витамин С), L-карнитин, лимонная кислота, натуральные ароматизаторы (апельсин, мята).',
        'Идеально подходит для:',
        '• Активных людей, ведущих динамичный образ жизни',
        '• Спортсменов и тех, кто занимается фитнесом',
        '• Людей, испытывающих повышенные умственные нагрузки',
        '• Тех, кто хочет укрепить свой иммунитет естественным путем',
        '• Людей, желающих поддерживать здоровый вес',
        '• Тех, кто ищет натуральное средство для поддержания общего тонуса'
    ],images:[Images.umnaya_voda_2,Images.umnaya_voda_2], price:1500}
]

export const Categories: TCategory[] = [
    { id:ECategories.EXTRACTS, text:'Флюидные экстракты'},
    { id:ECategories.SMART_WATER, text:'Концентрат напитка «Умная вода»'},
    { id:ECategories.NAPITKI, text:'Концентраты безалкогольных напитков'},
    { id:ECategories.TEA, text:'Чайный напиток на основе черного или зеленого чая'},
    { id:ECategories.COSMECTIK, text:'Косметическая продукция'},
]

